{
    "metadata": {
        "total_size": 29549989724
    },
    "weight_map": {
        "decoder.conv_in.bias": "ae.safetensors",
        "decoder.conv_in.weight": "ae.safetensors",
        "decoder.conv_out.bias": "ae.safetensors",
        "decoder.conv_out.weight": "ae.safetensors",
        "decoder.mid.attn_1.k.bias": "ae.safetensors",
        "decoder.mid.attn_1.k.weight": "ae.safetensors",
        "decoder.mid.attn_1.norm.bias": "ae.safetensors",
        "decoder.mid.attn_1.norm.weight": "ae.safetensors",
        "decoder.mid.attn_1.proj_out.bias": "ae.safetensors",
        "decoder.mid.attn_1.proj_out.weight": "ae.safetensors",
        "decoder.mid.attn_1.q.bias": "ae.safetensors",
        "decoder.mid.attn_1.q.weight": "ae.safetensors",
        "decoder.mid.attn_1.v.bias": "ae.safetensors",
        "decoder.mid.attn_1.v.weight": "ae.safetensors",
        "decoder.mid.block_1.conv1.bias": "ae.safetensors",
        "decoder.mid.block_1.conv1.weight": "ae.safetensors",
        "decoder.mid.block_1.conv2.bias": "ae.safetensors",
        "decoder.mid.block_1.conv2.weight": "ae.safetensors",
        "decoder.mid.block_1.norm1.bias": "ae.safetensors",
        "decoder.mid.block_1.norm1.weight": "ae.safetensors",
        "decoder.mid.block_1.norm2.bias": "ae.safetensors",
        "decoder.mid.block_1.norm2.weight": "ae.safetensors",
        "decoder.mid.block_2.conv1.bias": "ae.safetensors",
        "decoder.mid.block_2.conv1.weight": "ae.safetensors",
        "decoder.mid.block_2.conv2.bias": "ae.safetensors",
        "decoder.mid.block_2.conv2.weight": "ae.safetensors",
        "decoder.mid.block_2.norm1.bias": "ae.safetensors",
        "decoder.mid.block_2.norm1.weight": "ae.safetensors",
        "decoder.mid.block_2.norm2.bias": "ae.safetensors",
        "decoder.mid.block_2.norm2.weight": "ae.safetensors",
        "decoder.norm_out.bias": "ae.safetensors",
        "decoder.norm_out.weight": "ae.safetensors",
        "decoder.up.0.block.0.conv1.bias": "ae.safetensors",
        "decoder.up.0.block.0.conv1.weight": "ae.safetensors",
        "decoder.up.0.block.0.conv2.bias": "ae.safetensors",
        "decoder.up.0.block.0.conv2.weight": "ae.safetensors",
        "decoder.up.0.block.0.nin_shortcut.bias": "ae.safetensors",
        "decoder.up.0.block.0.nin_shortcut.weight": "ae.safetensors",
        "decoder.up.0.block.0.norm1.bias": "ae.safetensors",
        "decoder.up.0.block.0.norm1.weight": "ae.safetensors",
        "decoder.up.0.block.0.norm2.bias": "ae.safetensors",
        "decoder.up.0.block.0.norm2.weight": "ae.safetensors",
        "decoder.up.0.block.1.conv1.bias": "ae.safetensors",
        "decoder.up.0.block.1.conv1.weight": "ae.safetensors",
        "decoder.up.0.block.1.conv2.bias": "ae.safetensors",
        "decoder.up.0.block.1.conv2.weight": "ae.safetensors",
        "decoder.up.0.block.1.norm1.bias": "ae.safetensors",
        "decoder.up.0.block.1.norm1.weight": "ae.safetensors",
        "decoder.up.0.block.1.norm2.bias": "ae.safetensors",
        "decoder.up.0.block.1.norm2.weight": "ae.safetensors",
        "decoder.up.0.block.2.conv1.bias": "ae.safetensors",
        "decoder.up.0.block.2.conv1.weight": "ae.safetensors",
        "decoder.up.0.block.2.conv2.bias": "ae.safetensors",
        "decoder.up.0.block.2.conv2.weight": "ae.safetensors",
        "decoder.up.0.block.2.norm1.bias": "ae.safetensors",
        "decoder.up.0.block.2.norm1.weight": "ae.safetensors",
        "decoder.up.0.block.2.norm2.bias": "ae.safetensors",
        "decoder.up.0.block.2.norm2.weight": "ae.safetensors",
        "decoder.up.1.block.0.conv1.bias": "ae.safetensors",
        "decoder.up.1.block.0.conv1.weight": "ae.safetensors",
        "decoder.up.1.block.0.conv2.bias": "ae.safetensors",
        "decoder.up.1.block.0.conv2.weight": "ae.safetensors",
        "decoder.up.1.block.0.nin_shortcut.bias": "ae.safetensors",
        "decoder.up.1.block.0.nin_shortcut.weight": "ae.safetensors",
        "decoder.up.1.block.0.norm1.bias": "ae.safetensors",
        "decoder.up.1.block.0.norm1.weight": "ae.safetensors",
        "decoder.up.1.block.0.norm2.bias": "ae.safetensors",
        "decoder.up.1.block.0.norm2.weight": "ae.safetensors",
        "decoder.up.1.block.1.conv1.bias": "ae.safetensors",
        "decoder.up.1.block.1.conv1.weight": "ae.safetensors",
        "decoder.up.1.block.1.conv2.bias": "ae.safetensors",
        "decoder.up.1.block.1.conv2.weight": "ae.safetensors",
        "decoder.up.1.block.1.norm1.bias": "ae.safetensors",
        "decoder.up.1.block.1.norm1.weight": "ae.safetensors",
        "decoder.up.1.block.1.norm2.bias": "ae.safetensors",
        "decoder.up.1.block.1.norm2.weight": "ae.safetensors",
        "decoder.up.1.block.2.conv1.bias": "ae.safetensors",
        "decoder.up.1.block.2.conv1.weight": "ae.safetensors",
        "decoder.up.1.block.2.conv2.bias": "ae.safetensors",
        "decoder.up.1.block.2.conv2.weight": "ae.safetensors",
        "decoder.up.1.block.2.norm1.bias": "ae.safetensors",
        "decoder.up.1.block.2.norm1.weight": "ae.safetensors",
        "decoder.up.1.block.2.norm2.bias": "ae.safetensors",
        "decoder.up.1.block.2.norm2.weight": "ae.safetensors",
        "decoder.up.1.upsample.conv.bias": "ae.safetensors",
        "decoder.up.1.upsample.conv.weight": "ae.safetensors",
        "decoder.up.2.block.0.conv1.bias": "ae.safetensors",
        "decoder.up.2.block.0.conv1.weight": "ae.safetensors",
        "decoder.up.2.block.0.conv2.bias": "ae.safetensors",
        "decoder.up.2.block.0.conv2.weight": "ae.safetensors",
        "decoder.up.2.block.0.norm1.bias": "ae.safetensors",
        "decoder.up.2.block.0.norm1.weight": "ae.safetensors",
        "decoder.up.2.block.0.norm2.bias": "ae.safetensors",
        "decoder.up.2.block.0.norm2.weight": "ae.safetensors",
        "decoder.up.2.block.1.conv1.bias": "ae.safetensors",
        "decoder.up.2.block.1.conv1.weight": "ae.safetensors",
        "decoder.up.2.block.1.conv2.bias": "ae.safetensors",
        "decoder.up.2.block.1.conv2.weight": "ae.safetensors",
        "decoder.up.2.block.1.norm1.bias": "ae.safetensors",
        "decoder.up.2.block.1.norm1.weight": "ae.safetensors",
        "decoder.up.2.block.1.norm2.bias": "ae.safetensors",
        "decoder.up.2.block.1.norm2.weight": "ae.safetensors",
        "decoder.up.2.block.2.conv1.bias": "ae.safetensors",
        "decoder.up.2.block.2.conv1.weight": "ae.safetensors",
        "decoder.up.2.block.2.conv2.bias": "ae.safetensors",
        "decoder.up.2.block.2.conv2.weight": "ae.safetensors",
        "decoder.up.2.block.2.norm1.bias": "ae.safetensors",
        "decoder.up.2.block.2.norm1.weight": "ae.safetensors",
        "decoder.up.2.block.2.norm2.bias": "ae.safetensors",
        "decoder.up.2.block.2.norm2.weight": "ae.safetensors",
        "decoder.up.2.upsample.conv.bias": "ae.safetensors",
        "decoder.up.2.upsample.conv.weight": "ae.safetensors",
        "decoder.up.3.block.0.conv1.bias": "ae.safetensors",
        "decoder.up.3.block.0.conv1.weight": "ae.safetensors",
        "decoder.up.3.block.0.conv2.bias": "ae.safetensors",
        "decoder.up.3.block.0.conv2.weight": "ae.safetensors",
        "decoder.up.3.block.0.norm1.bias": "ae.safetensors",
        "decoder.up.3.block.0.norm1.weight": "ae.safetensors",
        "decoder.up.3.block.0.norm2.bias": "ae.safetensors",
        "decoder.up.3.block.0.norm2.weight": "ae.safetensors",
        "decoder.up.3.block.1.conv1.bias": "ae.safetensors",
        "decoder.up.3.block.1.conv1.weight": "ae.safetensors",
        "decoder.up.3.block.1.conv2.bias": "ae.safetensors",
        "decoder.up.3.block.1.conv2.weight": "ae.safetensors",
        "decoder.up.3.block.1.norm1.bias": "ae.safetensors",
        "decoder.up.3.block.1.norm1.weight": "ae.safetensors",
        "decoder.up.3.block.1.norm2.bias": "ae.safetensors",
        "decoder.up.3.block.1.norm2.weight": "ae.safetensors",
        "decoder.up.3.block.2.conv1.bias": "ae.safetensors",
        "decoder.up.3.block.2.conv1.weight": "ae.safetensors",
        "decoder.up.3.block.2.conv2.bias": "ae.safetensors",
        "decoder.up.3.block.2.conv2.weight": "ae.safetensors",
        "decoder.up.3.block.2.norm1.bias": "ae.safetensors",
        "decoder.up.3.block.2.norm1.weight": "ae.safetensors",
        "decoder.up.3.block.2.norm2.bias": "ae.safetensors",
        "decoder.up.3.block.2.norm2.weight": "ae.safetensors",
        "decoder.up.3.upsample.conv.bias": "ae.safetensors",
        "decoder.up.3.upsample.conv.weight": "ae.safetensors",
        "encoder.conv_in.bias": "ae.safetensors",
        "encoder.conv_in.weight": "ae.safetensors",
        "encoder.conv_out.bias": "ae.safetensors",
        "encoder.conv_out.weight": "ae.safetensors",
        "encoder.down.0.block.0.conv1.bias": "ae.safetensors",
        "encoder.down.0.block.0.conv1.weight": "ae.safetensors",
        "encoder.down.0.block.0.conv2.bias": "ae.safetensors",
        "encoder.down.0.block.0.conv2.weight": "ae.safetensors",
        "encoder.down.0.block.0.norm1.bias": "ae.safetensors",
        "encoder.down.0.block.0.norm1.weight": "ae.safetensors",
        "encoder.down.0.block.0.norm2.bias": "ae.safetensors",
        "encoder.down.0.block.0.norm2.weight": "ae.safetensors",
        "encoder.down.0.block.1.conv1.bias": "ae.safetensors",
        "encoder.down.0.block.1.conv1.weight": "ae.safetensors",
        "encoder.down.0.block.1.conv2.bias": "ae.safetensors",
        "encoder.down.0.block.1.conv2.weight": "ae.safetensors",
        "encoder.down.0.block.1.norm1.bias": "ae.safetensors",
        "encoder.down.0.block.1.norm1.weight": "ae.safetensors",
        "encoder.down.0.block.1.norm2.bias": "ae.safetensors",
        "encoder.down.0.block.1.norm2.weight": "ae.safetensors",
        "encoder.down.0.downsample.conv.bias": "ae.safetensors",
        "encoder.down.0.downsample.conv.weight": "ae.safetensors",
        "encoder.down.1.block.0.conv1.bias": "ae.safetensors",
        "encoder.down.1.block.0.conv1.weight": "ae.safetensors",
        "encoder.down.1.block.0.conv2.bias": "ae.safetensors",
        "encoder.down.1.block.0.conv2.weight": "ae.safetensors",
        "encoder.down.1.block.0.nin_shortcut.bias": "ae.safetensors",
        "encoder.down.1.block.0.nin_shortcut.weight": "ae.safetensors",
        "encoder.down.1.block.0.norm1.bias": "ae.safetensors",
        "encoder.down.1.block.0.norm1.weight": "ae.safetensors",
        "encoder.down.1.block.0.norm2.bias": "ae.safetensors",
        "encoder.down.1.block.0.norm2.weight": "ae.safetensors",
        "encoder.down.1.block.1.conv1.bias": "ae.safetensors",
        "encoder.down.1.block.1.conv1.weight": "ae.safetensors",
        "encoder.down.1.block.1.conv2.bias": "ae.safetensors",
        "encoder.down.1.block.1.conv2.weight": "ae.safetensors",
        "encoder.down.1.block.1.norm1.bias": "ae.safetensors",
        "encoder.down.1.block.1.norm1.weight": "ae.safetensors",
        "encoder.down.1.block.1.norm2.bias": "ae.safetensors",
        "encoder.down.1.block.1.norm2.weight": "ae.safetensors",
        "encoder.down.1.downsample.conv.bias": "ae.safetensors",
        "encoder.down.1.downsample.conv.weight": "ae.safetensors",
        "encoder.down.2.block.0.conv1.bias": "ae.safetensors",
        "encoder.down.2.block.0.conv1.weight": "ae.safetensors",
        "encoder.down.2.block.0.conv2.bias": "ae.safetensors",
        "encoder.down.2.block.0.conv2.weight": "ae.safetensors",
        "encoder.down.2.block.0.nin_shortcut.bias": "ae.safetensors",
        "encoder.down.2.block.0.nin_shortcut.weight": "ae.safetensors",
        "encoder.down.2.block.0.norm1.bias": "ae.safetensors",
        "encoder.down.2.block.0.norm1.weight": "ae.safetensors",
        "encoder.down.2.block.0.norm2.bias": "ae.safetensors",
        "encoder.down.2.block.0.norm2.weight": "ae.safetensors",
        "encoder.down.2.block.1.conv1.bias": "ae.safetensors",
        "encoder.down.2.block.1.conv1.weight": "ae.safetensors",
        "encoder.down.2.block.1.conv2.bias": "ae.safetensors",
        "encoder.down.2.block.1.conv2.weight": "ae.safetensors",
        "encoder.down.2.block.1.norm1.bias": "ae.safetensors",
        "encoder.down.2.block.1.norm1.weight": "ae.safetensors",
        "encoder.down.2.block.1.norm2.bias": "ae.safetensors",
        "encoder.down.2.block.1.norm2.weight": "ae.safetensors",
        "encoder.down.2.downsample.conv.bias": "ae.safetensors",
        "encoder.down.2.downsample.conv.weight": "ae.safetensors",
        "encoder.down.3.block.0.conv1.bias": "ae.safetensors",
        "encoder.down.3.block.0.conv1.weight": "ae.safetensors",
        "encoder.down.3.block.0.conv2.bias": "ae.safetensors",
        "encoder.down.3.block.0.conv2.weight": "ae.safetensors",
        "encoder.down.3.block.0.norm1.bias": "ae.safetensors",
        "encoder.down.3.block.0.norm1.weight": "ae.safetensors",
        "encoder.down.3.block.0.norm2.bias": "ae.safetensors",
        "encoder.down.3.block.0.norm2.weight": "ae.safetensors",
        "encoder.down.3.block.1.conv1.bias": "ae.safetensors",
        "encoder.down.3.block.1.conv1.weight": "ae.safetensors",
        "encoder.down.3.block.1.conv2.bias": "ae.safetensors",
        "encoder.down.3.block.1.conv2.weight": "ae.safetensors",
        "encoder.down.3.block.1.norm1.bias": "ae.safetensors",
        "encoder.down.3.block.1.norm1.weight": "ae.safetensors",
        "encoder.down.3.block.1.norm2.bias": "ae.safetensors",
        "encoder.down.3.block.1.norm2.weight": "ae.safetensors",
        "encoder.mid.attn_1.k.bias": "ae.safetensors",
        "encoder.mid.attn_1.k.weight": "ae.safetensors",
        "encoder.mid.attn_1.norm.bias": "ae.safetensors",
        "encoder.mid.attn_1.norm.weight": "ae.safetensors",
        "encoder.mid.attn_1.proj_out.bias": "ae.safetensors",
        "encoder.mid.attn_1.proj_out.weight": "ae.safetensors",
        "encoder.mid.attn_1.q.bias": "ae.safetensors",
        "encoder.mid.attn_1.q.weight": "ae.safetensors",
        "encoder.mid.attn_1.v.bias": "ae.safetensors",
        "encoder.mid.attn_1.v.weight": "ae.safetensors",
        "encoder.mid.block_1.conv1.bias": "ae.safetensors",
        "encoder.mid.block_1.conv1.weight": "ae.safetensors",
        "encoder.mid.block_1.conv2.bias": "ae.safetensors",
        "encoder.mid.block_1.conv2.weight": "ae.safetensors",
        "encoder.mid.block_1.norm1.bias": "ae.safetensors",
        "encoder.mid.block_1.norm1.weight": "ae.safetensors",
        "encoder.mid.block_1.norm2.bias": "ae.safetensors",
        "encoder.mid.block_1.norm2.weight": "ae.safetensors",
        "encoder.mid.block_2.conv1.bias": "ae.safetensors",
        "encoder.mid.block_2.conv1.weight": "ae.safetensors",
        "encoder.mid.block_2.conv2.bias": "ae.safetensors",
        "encoder.mid.block_2.conv2.weight": "ae.safetensors",
        "encoder.mid.block_2.norm1.bias": "ae.safetensors",
        "encoder.mid.block_2.norm1.weight": "ae.safetensors",
        "encoder.mid.block_2.norm2.bias": "ae.safetensors",
        "encoder.mid.block_2.norm2.weight": "ae.safetensors",
        "encoder.norm_out.bias": "ae.safetensors",
        "encoder.norm_out.weight": "ae.safetensors",
        "connector.fc1.bias": "ema.safetensors",
        "connector.fc1.weight": "ema.safetensors",
        "connector.fc2.bias": "ema.safetensors",
        "connector.fc2.weight": "ema.safetensors",
        "language_model.lm_head.weight": "ema.safetensors",
        "language_model.model.embed_tokens.weight": "ema.safetensors",
        "language_model.model.layers.0.input_layernorm.weight": "ema.safetensors",
        "language_model.model.layers.0.input_layernorm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.0.mlp.down_proj.weight": "ema.safetensors",
        "language_model.model.layers.0.mlp.gate_proj.weight": "ema.safetensors",
        "language_model.model.layers.0.mlp.up_proj.weight": "ema.safetensors",
        "language_model.model.layers.0.mlp_moe_gen.down_proj.weight": "ema.safetensors",
        "language_model.model.layers.0.mlp_moe_gen.gate_proj.weight": "ema.safetensors",
        "language_model.model.layers.0.mlp_moe_gen.up_proj.weight": "ema.safetensors",
        "language_model.model.layers.0.post_attention_layernorm.weight": "ema.safetensors",
        "language_model.model.layers.0.post_attention_layernorm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.0.self_attn.k_norm.weight": "ema.safetensors",
        "language_model.model.layers.0.self_attn.k_norm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.0.self_attn.k_proj.bias": "ema.safetensors",
        "language_model.model.layers.0.self_attn.k_proj.weight": "ema.safetensors",
        "language_model.model.layers.0.self_attn.k_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.0.self_attn.k_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.0.self_attn.o_proj.weight": "ema.safetensors",
        "language_model.model.layers.0.self_attn.o_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.0.self_attn.q_norm.weight": "ema.safetensors",
        "language_model.model.layers.0.self_attn.q_norm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.0.self_attn.q_proj.bias": "ema.safetensors",
        "language_model.model.layers.0.self_attn.q_proj.weight": "ema.safetensors",
        "language_model.model.layers.0.self_attn.q_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.0.self_attn.q_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.0.self_attn.v_proj.bias": "ema.safetensors",
        "language_model.model.layers.0.self_attn.v_proj.weight": "ema.safetensors",
        "language_model.model.layers.0.self_attn.v_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.0.self_attn.v_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.1.input_layernorm.weight": "ema.safetensors",
        "language_model.model.layers.1.input_layernorm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.1.mlp.down_proj.weight": "ema.safetensors",
        "language_model.model.layers.1.mlp.gate_proj.weight": "ema.safetensors",
        "language_model.model.layers.1.mlp.up_proj.weight": "ema.safetensors",
        "language_model.model.layers.1.mlp_moe_gen.down_proj.weight": "ema.safetensors",
        "language_model.model.layers.1.mlp_moe_gen.gate_proj.weight": "ema.safetensors",
        "language_model.model.layers.1.mlp_moe_gen.up_proj.weight": "ema.safetensors",
        "language_model.model.layers.1.post_attention_layernorm.weight": "ema.safetensors",
        "language_model.model.layers.1.post_attention_layernorm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.1.self_attn.k_norm.weight": "ema.safetensors",
        "language_model.model.layers.1.self_attn.k_norm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.1.self_attn.k_proj.bias": "ema.safetensors",
        "language_model.model.layers.1.self_attn.k_proj.weight": "ema.safetensors",
        "language_model.model.layers.1.self_attn.k_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.1.self_attn.k_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.1.self_attn.o_proj.weight": "ema.safetensors",
        "language_model.model.layers.1.self_attn.o_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.1.self_attn.q_norm.weight": "ema.safetensors",
        "language_model.model.layers.1.self_attn.q_norm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.1.self_attn.q_proj.bias": "ema.safetensors",
        "language_model.model.layers.1.self_attn.q_proj.weight": "ema.safetensors",
        "language_model.model.layers.1.self_attn.q_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.1.self_attn.q_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.1.self_attn.v_proj.bias": "ema.safetensors",
        "language_model.model.layers.1.self_attn.v_proj.weight": "ema.safetensors",
        "language_model.model.layers.1.self_attn.v_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.1.self_attn.v_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.10.input_layernorm.weight": "ema.safetensors",
        "language_model.model.layers.10.input_layernorm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.10.mlp.down_proj.weight": "ema.safetensors",
        "language_model.model.layers.10.mlp.gate_proj.weight": "ema.safetensors",
        "language_model.model.layers.10.mlp.up_proj.weight": "ema.safetensors",
        "language_model.model.layers.10.mlp_moe_gen.down_proj.weight": "ema.safetensors",
        "language_model.model.layers.10.mlp_moe_gen.gate_proj.weight": "ema.safetensors",
        "language_model.model.layers.10.mlp_moe_gen.up_proj.weight": "ema.safetensors",
        "language_model.model.layers.10.post_attention_layernorm.weight": "ema.safetensors",
        "language_model.model.layers.10.post_attention_layernorm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.10.self_attn.k_norm.weight": "ema.safetensors",
        "language_model.model.layers.10.self_attn.k_norm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.10.self_attn.k_proj.bias": "ema.safetensors",
        "language_model.model.layers.10.self_attn.k_proj.weight": "ema.safetensors",
        "language_model.model.layers.10.self_attn.k_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.10.self_attn.k_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.10.self_attn.o_proj.weight": "ema.safetensors",
        "language_model.model.layers.10.self_attn.o_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.10.self_attn.q_norm.weight": "ema.safetensors",
        "language_model.model.layers.10.self_attn.q_norm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.10.self_attn.q_proj.bias": "ema.safetensors",
        "language_model.model.layers.10.self_attn.q_proj.weight": "ema.safetensors",
        "language_model.model.layers.10.self_attn.q_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.10.self_attn.q_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.10.self_attn.v_proj.bias": "ema.safetensors",
        "language_model.model.layers.10.self_attn.v_proj.weight": "ema.safetensors",
        "language_model.model.layers.10.self_attn.v_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.10.self_attn.v_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.11.input_layernorm.weight": "ema.safetensors",
        "language_model.model.layers.11.input_layernorm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.11.mlp.down_proj.weight": "ema.safetensors",
        "language_model.model.layers.11.mlp.gate_proj.weight": "ema.safetensors",
        "language_model.model.layers.11.mlp.up_proj.weight": "ema.safetensors",
        "language_model.model.layers.11.mlp_moe_gen.down_proj.weight": "ema.safetensors",
        "language_model.model.layers.11.mlp_moe_gen.gate_proj.weight": "ema.safetensors",
        "language_model.model.layers.11.mlp_moe_gen.up_proj.weight": "ema.safetensors",
        "language_model.model.layers.11.post_attention_layernorm.weight": "ema.safetensors",
        "language_model.model.layers.11.post_attention_layernorm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.11.self_attn.k_norm.weight": "ema.safetensors",
        "language_model.model.layers.11.self_attn.k_norm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.11.self_attn.k_proj.bias": "ema.safetensors",
        "language_model.model.layers.11.self_attn.k_proj.weight": "ema.safetensors",
        "language_model.model.layers.11.self_attn.k_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.11.self_attn.k_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.11.self_attn.o_proj.weight": "ema.safetensors",
        "language_model.model.layers.11.self_attn.o_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.11.self_attn.q_norm.weight": "ema.safetensors",
        "language_model.model.layers.11.self_attn.q_norm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.11.self_attn.q_proj.bias": "ema.safetensors",
        "language_model.model.layers.11.self_attn.q_proj.weight": "ema.safetensors",
        "language_model.model.layers.11.self_attn.q_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.11.self_attn.q_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.11.self_attn.v_proj.bias": "ema.safetensors",
        "language_model.model.layers.11.self_attn.v_proj.weight": "ema.safetensors",
        "language_model.model.layers.11.self_attn.v_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.11.self_attn.v_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.12.input_layernorm.weight": "ema.safetensors",
        "language_model.model.layers.12.input_layernorm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.12.mlp.down_proj.weight": "ema.safetensors",
        "language_model.model.layers.12.mlp.gate_proj.weight": "ema.safetensors",
        "language_model.model.layers.12.mlp.up_proj.weight": "ema.safetensors",
        "language_model.model.layers.12.mlp_moe_gen.down_proj.weight": "ema.safetensors",
        "language_model.model.layers.12.mlp_moe_gen.gate_proj.weight": "ema.safetensors",
        "language_model.model.layers.12.mlp_moe_gen.up_proj.weight": "ema.safetensors",
        "language_model.model.layers.12.post_attention_layernorm.weight": "ema.safetensors",
        "language_model.model.layers.12.post_attention_layernorm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.12.self_attn.k_norm.weight": "ema.safetensors",
        "language_model.model.layers.12.self_attn.k_norm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.12.self_attn.k_proj.bias": "ema.safetensors",
        "language_model.model.layers.12.self_attn.k_proj.weight": "ema.safetensors",
        "language_model.model.layers.12.self_attn.k_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.12.self_attn.k_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.12.self_attn.o_proj.weight": "ema.safetensors",
        "language_model.model.layers.12.self_attn.o_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.12.self_attn.q_norm.weight": "ema.safetensors",
        "language_model.model.layers.12.self_attn.q_norm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.12.self_attn.q_proj.bias": "ema.safetensors",
        "language_model.model.layers.12.self_attn.q_proj.weight": "ema.safetensors",
        "language_model.model.layers.12.self_attn.q_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.12.self_attn.q_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.12.self_attn.v_proj.bias": "ema.safetensors",
        "language_model.model.layers.12.self_attn.v_proj.weight": "ema.safetensors",
        "language_model.model.layers.12.self_attn.v_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.12.self_attn.v_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.13.input_layernorm.weight": "ema.safetensors",
        "language_model.model.layers.13.input_layernorm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.13.mlp.down_proj.weight": "ema.safetensors",
        "language_model.model.layers.13.mlp.gate_proj.weight": "ema.safetensors",
        "language_model.model.layers.13.mlp.up_proj.weight": "ema.safetensors",
        "language_model.model.layers.13.mlp_moe_gen.down_proj.weight": "ema.safetensors",
        "language_model.model.layers.13.mlp_moe_gen.gate_proj.weight": "ema.safetensors",
        "language_model.model.layers.13.mlp_moe_gen.up_proj.weight": "ema.safetensors",
        "language_model.model.layers.13.post_attention_layernorm.weight": "ema.safetensors",
        "language_model.model.layers.13.post_attention_layernorm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.13.self_attn.k_norm.weight": "ema.safetensors",
        "language_model.model.layers.13.self_attn.k_norm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.13.self_attn.k_proj.bias": "ema.safetensors",
        "language_model.model.layers.13.self_attn.k_proj.weight": "ema.safetensors",
        "language_model.model.layers.13.self_attn.k_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.13.self_attn.k_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.13.self_attn.o_proj.weight": "ema.safetensors",
        "language_model.model.layers.13.self_attn.o_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.13.self_attn.q_norm.weight": "ema.safetensors",
        "language_model.model.layers.13.self_attn.q_norm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.13.self_attn.q_proj.bias": "ema.safetensors",
        "language_model.model.layers.13.self_attn.q_proj.weight": "ema.safetensors",
        "language_model.model.layers.13.self_attn.q_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.13.self_attn.q_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.13.self_attn.v_proj.bias": "ema.safetensors",
        "language_model.model.layers.13.self_attn.v_proj.weight": "ema.safetensors",
        "language_model.model.layers.13.self_attn.v_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.13.self_attn.v_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.14.input_layernorm.weight": "ema.safetensors",
        "language_model.model.layers.14.input_layernorm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.14.mlp.down_proj.weight": "ema.safetensors",
        "language_model.model.layers.14.mlp.gate_proj.weight": "ema.safetensors",
        "language_model.model.layers.14.mlp.up_proj.weight": "ema.safetensors",
        "language_model.model.layers.14.mlp_moe_gen.down_proj.weight": "ema.safetensors",
        "language_model.model.layers.14.mlp_moe_gen.gate_proj.weight": "ema.safetensors",
        "language_model.model.layers.14.mlp_moe_gen.up_proj.weight": "ema.safetensors",
        "language_model.model.layers.14.post_attention_layernorm.weight": "ema.safetensors",
        "language_model.model.layers.14.post_attention_layernorm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.14.self_attn.k_norm.weight": "ema.safetensors",
        "language_model.model.layers.14.self_attn.k_norm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.14.self_attn.k_proj.bias": "ema.safetensors",
        "language_model.model.layers.14.self_attn.k_proj.weight": "ema.safetensors",
        "language_model.model.layers.14.self_attn.k_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.14.self_attn.k_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.14.self_attn.o_proj.weight": "ema.safetensors",
        "language_model.model.layers.14.self_attn.o_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.14.self_attn.q_norm.weight": "ema.safetensors",
        "language_model.model.layers.14.self_attn.q_norm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.14.self_attn.q_proj.bias": "ema.safetensors",
        "language_model.model.layers.14.self_attn.q_proj.weight": "ema.safetensors",
        "language_model.model.layers.14.self_attn.q_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.14.self_attn.q_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.14.self_attn.v_proj.bias": "ema.safetensors",
        "language_model.model.layers.14.self_attn.v_proj.weight": "ema.safetensors",
        "language_model.model.layers.14.self_attn.v_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.14.self_attn.v_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.15.input_layernorm.weight": "ema.safetensors",
        "language_model.model.layers.15.input_layernorm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.15.mlp.down_proj.weight": "ema.safetensors",
        "language_model.model.layers.15.mlp.gate_proj.weight": "ema.safetensors",
        "language_model.model.layers.15.mlp.up_proj.weight": "ema.safetensors",
        "language_model.model.layers.15.mlp_moe_gen.down_proj.weight": "ema.safetensors",
        "language_model.model.layers.15.mlp_moe_gen.gate_proj.weight": "ema.safetensors",
        "language_model.model.layers.15.mlp_moe_gen.up_proj.weight": "ema.safetensors",
        "language_model.model.layers.15.post_attention_layernorm.weight": "ema.safetensors",
        "language_model.model.layers.15.post_attention_layernorm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.15.self_attn.k_norm.weight": "ema.safetensors",
        "language_model.model.layers.15.self_attn.k_norm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.15.self_attn.k_proj.bias": "ema.safetensors",
        "language_model.model.layers.15.self_attn.k_proj.weight": "ema.safetensors",
        "language_model.model.layers.15.self_attn.k_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.15.self_attn.k_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.15.self_attn.o_proj.weight": "ema.safetensors",
        "language_model.model.layers.15.self_attn.o_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.15.self_attn.q_norm.weight": "ema.safetensors",
        "language_model.model.layers.15.self_attn.q_norm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.15.self_attn.q_proj.bias": "ema.safetensors",
        "language_model.model.layers.15.self_attn.q_proj.weight": "ema.safetensors",
        "language_model.model.layers.15.self_attn.q_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.15.self_attn.q_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.15.self_attn.v_proj.bias": "ema.safetensors",
        "language_model.model.layers.15.self_attn.v_proj.weight": "ema.safetensors",
        "language_model.model.layers.15.self_attn.v_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.15.self_attn.v_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.16.input_layernorm.weight": "ema.safetensors",
        "language_model.model.layers.16.input_layernorm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.16.mlp.down_proj.weight": "ema.safetensors",
        "language_model.model.layers.16.mlp.gate_proj.weight": "ema.safetensors",
        "language_model.model.layers.16.mlp.up_proj.weight": "ema.safetensors",
        "language_model.model.layers.16.mlp_moe_gen.down_proj.weight": "ema.safetensors",
        "language_model.model.layers.16.mlp_moe_gen.gate_proj.weight": "ema.safetensors",
        "language_model.model.layers.16.mlp_moe_gen.up_proj.weight": "ema.safetensors",
        "language_model.model.layers.16.post_attention_layernorm.weight": "ema.safetensors",
        "language_model.model.layers.16.post_attention_layernorm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.16.self_attn.k_norm.weight": "ema.safetensors",
        "language_model.model.layers.16.self_attn.k_norm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.16.self_attn.k_proj.bias": "ema.safetensors",
        "language_model.model.layers.16.self_attn.k_proj.weight": "ema.safetensors",
        "language_model.model.layers.16.self_attn.k_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.16.self_attn.k_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.16.self_attn.o_proj.weight": "ema.safetensors",
        "language_model.model.layers.16.self_attn.o_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.16.self_attn.q_norm.weight": "ema.safetensors",
        "language_model.model.layers.16.self_attn.q_norm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.16.self_attn.q_proj.bias": "ema.safetensors",
        "language_model.model.layers.16.self_attn.q_proj.weight": "ema.safetensors",
        "language_model.model.layers.16.self_attn.q_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.16.self_attn.q_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.16.self_attn.v_proj.bias": "ema.safetensors",
        "language_model.model.layers.16.self_attn.v_proj.weight": "ema.safetensors",
        "language_model.model.layers.16.self_attn.v_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.16.self_attn.v_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.17.input_layernorm.weight": "ema.safetensors",
        "language_model.model.layers.17.input_layernorm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.17.mlp.down_proj.weight": "ema.safetensors",
        "language_model.model.layers.17.mlp.gate_proj.weight": "ema.safetensors",
        "language_model.model.layers.17.mlp.up_proj.weight": "ema.safetensors",
        "language_model.model.layers.17.mlp_moe_gen.down_proj.weight": "ema.safetensors",
        "language_model.model.layers.17.mlp_moe_gen.gate_proj.weight": "ema.safetensors",
        "language_model.model.layers.17.mlp_moe_gen.up_proj.weight": "ema.safetensors",
        "language_model.model.layers.17.post_attention_layernorm.weight": "ema.safetensors",
        "language_model.model.layers.17.post_attention_layernorm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.17.self_attn.k_norm.weight": "ema.safetensors",
        "language_model.model.layers.17.self_attn.k_norm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.17.self_attn.k_proj.bias": "ema.safetensors",
        "language_model.model.layers.17.self_attn.k_proj.weight": "ema.safetensors",
        "language_model.model.layers.17.self_attn.k_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.17.self_attn.k_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.17.self_attn.o_proj.weight": "ema.safetensors",
        "language_model.model.layers.17.self_attn.o_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.17.self_attn.q_norm.weight": "ema.safetensors",
        "language_model.model.layers.17.self_attn.q_norm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.17.self_attn.q_proj.bias": "ema.safetensors",
        "language_model.model.layers.17.self_attn.q_proj.weight": "ema.safetensors",
        "language_model.model.layers.17.self_attn.q_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.17.self_attn.q_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.17.self_attn.v_proj.bias": "ema.safetensors",
        "language_model.model.layers.17.self_attn.v_proj.weight": "ema.safetensors",
        "language_model.model.layers.17.self_attn.v_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.17.self_attn.v_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.18.input_layernorm.weight": "ema.safetensors",
        "language_model.model.layers.18.input_layernorm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.18.mlp.down_proj.weight": "ema.safetensors",
        "language_model.model.layers.18.mlp.gate_proj.weight": "ema.safetensors",
        "language_model.model.layers.18.mlp.up_proj.weight": "ema.safetensors",
        "language_model.model.layers.18.mlp_moe_gen.down_proj.weight": "ema.safetensors",
        "language_model.model.layers.18.mlp_moe_gen.gate_proj.weight": "ema.safetensors",
        "language_model.model.layers.18.mlp_moe_gen.up_proj.weight": "ema.safetensors",
        "language_model.model.layers.18.post_attention_layernorm.weight": "ema.safetensors",
        "language_model.model.layers.18.post_attention_layernorm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.18.self_attn.k_norm.weight": "ema.safetensors",
        "language_model.model.layers.18.self_attn.k_norm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.18.self_attn.k_proj.bias": "ema.safetensors",
        "language_model.model.layers.18.self_attn.k_proj.weight": "ema.safetensors",
        "language_model.model.layers.18.self_attn.k_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.18.self_attn.k_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.18.self_attn.o_proj.weight": "ema.safetensors",
        "language_model.model.layers.18.self_attn.o_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.18.self_attn.q_norm.weight": "ema.safetensors",
        "language_model.model.layers.18.self_attn.q_norm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.18.self_attn.q_proj.bias": "ema.safetensors",
        "language_model.model.layers.18.self_attn.q_proj.weight": "ema.safetensors",
        "language_model.model.layers.18.self_attn.q_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.18.self_attn.q_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.18.self_attn.v_proj.bias": "ema.safetensors",
        "language_model.model.layers.18.self_attn.v_proj.weight": "ema.safetensors",
        "language_model.model.layers.18.self_attn.v_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.18.self_attn.v_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.19.input_layernorm.weight": "ema.safetensors",
        "language_model.model.layers.19.input_layernorm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.19.mlp.down_proj.weight": "ema.safetensors",
        "language_model.model.layers.19.mlp.gate_proj.weight": "ema.safetensors",
        "language_model.model.layers.19.mlp.up_proj.weight": "ema.safetensors",
        "language_model.model.layers.19.mlp_moe_gen.down_proj.weight": "ema.safetensors",
        "language_model.model.layers.19.mlp_moe_gen.gate_proj.weight": "ema.safetensors",
        "language_model.model.layers.19.mlp_moe_gen.up_proj.weight": "ema.safetensors",
        "language_model.model.layers.19.post_attention_layernorm.weight": "ema.safetensors",
        "language_model.model.layers.19.post_attention_layernorm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.19.self_attn.k_norm.weight": "ema.safetensors",
        "language_model.model.layers.19.self_attn.k_norm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.19.self_attn.k_proj.bias": "ema.safetensors",
        "language_model.model.layers.19.self_attn.k_proj.weight": "ema.safetensors",
        "language_model.model.layers.19.self_attn.k_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.19.self_attn.k_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.19.self_attn.o_proj.weight": "ema.safetensors",
        "language_model.model.layers.19.self_attn.o_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.19.self_attn.q_norm.weight": "ema.safetensors",
        "language_model.model.layers.19.self_attn.q_norm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.19.self_attn.q_proj.bias": "ema.safetensors",
        "language_model.model.layers.19.self_attn.q_proj.weight": "ema.safetensors",
        "language_model.model.layers.19.self_attn.q_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.19.self_attn.q_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.19.self_attn.v_proj.bias": "ema.safetensors",
        "language_model.model.layers.19.self_attn.v_proj.weight": "ema.safetensors",
        "language_model.model.layers.19.self_attn.v_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.19.self_attn.v_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.2.input_layernorm.weight": "ema.safetensors",
        "language_model.model.layers.2.input_layernorm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.2.mlp.down_proj.weight": "ema.safetensors",
        "language_model.model.layers.2.mlp.gate_proj.weight": "ema.safetensors",
        "language_model.model.layers.2.mlp.up_proj.weight": "ema.safetensors",
        "language_model.model.layers.2.mlp_moe_gen.down_proj.weight": "ema.safetensors",
        "language_model.model.layers.2.mlp_moe_gen.gate_proj.weight": "ema.safetensors",
        "language_model.model.layers.2.mlp_moe_gen.up_proj.weight": "ema.safetensors",
        "language_model.model.layers.2.post_attention_layernorm.weight": "ema.safetensors",
        "language_model.model.layers.2.post_attention_layernorm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.2.self_attn.k_norm.weight": "ema.safetensors",
        "language_model.model.layers.2.self_attn.k_norm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.2.self_attn.k_proj.bias": "ema.safetensors",
        "language_model.model.layers.2.self_attn.k_proj.weight": "ema.safetensors",
        "language_model.model.layers.2.self_attn.k_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.2.self_attn.k_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.2.self_attn.o_proj.weight": "ema.safetensors",
        "language_model.model.layers.2.self_attn.o_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.2.self_attn.q_norm.weight": "ema.safetensors",
        "language_model.model.layers.2.self_attn.q_norm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.2.self_attn.q_proj.bias": "ema.safetensors",
        "language_model.model.layers.2.self_attn.q_proj.weight": "ema.safetensors",
        "language_model.model.layers.2.self_attn.q_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.2.self_attn.q_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.2.self_attn.v_proj.bias": "ema.safetensors",
        "language_model.model.layers.2.self_attn.v_proj.weight": "ema.safetensors",
        "language_model.model.layers.2.self_attn.v_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.2.self_attn.v_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.20.input_layernorm.weight": "ema.safetensors",
        "language_model.model.layers.20.input_layernorm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.20.mlp.down_proj.weight": "ema.safetensors",
        "language_model.model.layers.20.mlp.gate_proj.weight": "ema.safetensors",
        "language_model.model.layers.20.mlp.up_proj.weight": "ema.safetensors",
        "language_model.model.layers.20.mlp_moe_gen.down_proj.weight": "ema.safetensors",
        "language_model.model.layers.20.mlp_moe_gen.gate_proj.weight": "ema.safetensors",
        "language_model.model.layers.20.mlp_moe_gen.up_proj.weight": "ema.safetensors",
        "language_model.model.layers.20.post_attention_layernorm.weight": "ema.safetensors",
        "language_model.model.layers.20.post_attention_layernorm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.20.self_attn.k_norm.weight": "ema.safetensors",
        "language_model.model.layers.20.self_attn.k_norm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.20.self_attn.k_proj.bias": "ema.safetensors",
        "language_model.model.layers.20.self_attn.k_proj.weight": "ema.safetensors",
        "language_model.model.layers.20.self_attn.k_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.20.self_attn.k_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.20.self_attn.o_proj.weight": "ema.safetensors",
        "language_model.model.layers.20.self_attn.o_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.20.self_attn.q_norm.weight": "ema.safetensors",
        "language_model.model.layers.20.self_attn.q_norm_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.20.self_attn.q_proj.bias": "ema.safetensors",
        "language_model.model.layers.20.self_attn.q_proj.weight": "ema.safetensors",
        "language_model.model.layers.20.self_attn.q_proj_moe_gen.bias": "ema.safetensors",
        "language_model.model.layers.20.self_attn.q_proj_moe_gen.weight": "ema.safetensors",
        "language_model.model.layers.20.self_attn.v_proj.bias": "ema.safetensors",
        "language_model.model.layers.20.self_attn.v_proj.weight": "ema.safetensors",
        "language_model.model.layers.20.self_attn.v_proj_moe_gen.bias": "ema.safetensors",
